Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཏེ། ཡུམ་གྱི་སྐུ་ན་བཞུགས་པ་དང་། བལྟམ་པ་དང་གཤེགས་སྟབས་བདུན་དུ་བཞུད་པ་དང་། སེང་གེའི་ང་རོ་ཆེན་པོ་སྒྲོགས་པ་དང་། གཞོན་ནུའི་ས་ལ་བཞུགས་པ་དང་། བཙུན་མོའི་འཁོར་གྱི་ནང་ན་བཞུགས་པའམ། མངོན་པར་འབྱུང་བའམ། བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འམ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའམ། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པ་མཛད་པའི་ཚེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་དང་། རྣམ་པར་གདུལ་བ་མཛད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཅད་དམ་པའི་ཆོས་མཐར་ཐུག་པར་ཟད་ཀྱི་བར་དུ་ཁོ་མོས་ཤེས་སོ། །དྲན་ནོ།
en: “I know when those buddha bhagavats were bodhisattvas, were within the bodies of their mothers, were born, took their first seven steps, roared the lion’s roar, were youths, were within their harems, set forth into homelessness, attained the enlightenment of buddhahood, turned the wheel of the Dharma, and displayed all the miraculous manifestations of a buddha, and when they ripened and guided beings, throughout all those times, from their first development of the aspiration for enlightenment until their final Dharma teaching.

source: །རྗེས་སུ་དྲན་ནོ། །བཟུང་ངོ་། །ཡོངས་སུ་བཟུང་ངོ་། །ཉེ་བར་བཟུང་ངོ་། །རྗེས་སུ་འབྲང་བར་བྱེད་དོ། །བསྐལ་པས་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ།
en: I remember that, recollect that, grasp that, retain that, reflect upon that, and follow that.

source: ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གདྒཱ་བཅུའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ།
en: “There was a kalpa called Subhūti , in which I served as many tathāgatas as there are grains of sand in ten Ganges Rivers.

source: །བསྐལ་པ་གྲགས་པ་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ།
en: “There was a kalpa called Subhaga, in which I served as many tathāgatas as there are atoms in a buddha realm.

source: །བསྐལ་པ་དམིགས་སུ་མེད་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་བསྙེན་བཀུར་ཏོ།
en: “There was a kalpa called Anilambha, in which I served eighty-four hundred thousand quintillion tathāgatas.

source: །བསྐལ་པ་འོད་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ།
en: “There was a kalpa called Suprabha , in which I served as many tathāgatas as there are atoms in Jambudvīpa.

source: །བསྐལ་པ་འོད་གཞལ་དུ་མེད་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གངྒཱ་ཉི་ཤུའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ།
en: “There was a kalpa called Atulaprabha, in which I served as many tathāgatas as there are grains of sand in twenty Ganges Rivers.

source: །བསྐལ་པ་དཔལ་ཤིན་ཏུ་འབར་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གང་གཱའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ།
en: “There was a kalpa called Uttaptaśrī, in which I served as many tathāgatas as there are grains of sand in one Ganges River.

source: །བསྐལ་པ་སྙིང་རྗེ་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གང་གཱ་བརྒྱད་ཅུའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ།
en: “There was a kalpa called Sūryodaya, in which I served as many tathāgatas as there are grains of sand in eighty Ganges Rivers.

source: །བསྐལ་པ་རྒྱལ་བར་གྱུར་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གངྒཱ་དྲུག་ཅུའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ།
en: “There was a kalpa called Jayaṃgama, in which I served as many tathāgatas as there are grains of sand in sixty Ganges Rivers.

source: །བསྐལ་པ་ཟླ་བ་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གང་གཱ་བདུན་ཅུའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ།
en: “There was a kalpa called Sucandra , in which I served as many tathāgatas as there are grains of sand in seventy Ganges Rivers.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཚུལ་དེ་བཞིན་དུ་ཁོ་མོ་རྟག་ཏུ་རྒྱུན་མ་ཆད་པར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་དང་བྲལ་བར་མ་གྱུར་པ་ནི་བསྐལ་པ་ཆུ་ཀླུང་གངྒཱའི་བྱེ་མ་སྙེད་ཅིག་དྲན་ཏེ།
en: “Noble one, in that way, I remember never being apart from the tathāgata arhat samyak­saṃbuddhas throughout kalpas as numerous as the grains of sand in the Ganges River.

source: ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དྲན་པ་ཐོགས་པ་མེད་ལ་རྣམ་པར་དག་པས་བརྒྱན་པ་འདི་ཐོས་སོ།
en: I heard from all those tathāgatas this bodhisattva liberation called the display of pure, unimpeded memory

source: །ཐོས་ནས་ཀྱང་ཡོངས་སུ་བཟུང་ངོ་།
en: I heard it and retained it.

source: །ཇི་སྐད་དུ་གསུངས་པ་བཞིན་དུ་ཁོང་དུ་ཆུད་དོ།
en: I comprehended whatever they said.

source: །རྣམ་པར་ཐར་པ་འདི་ཉིད་ལ་ཁོ་མོ་རྟག་ཏུ་རྒྱུན་མ་ཆད་པར་རྗེས་སུ་ཞུགས་པར་གནས་གནས་ཏེ།
en: I have constantly, always remained within this liberation.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཉེ་བར་བཟུང་བ་ནས་དམ་པའི་ཆོས་གནས་པ་ཟད་པའི་མཐར་ཐུག་གི་བར་གྱི་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དྲན་པ་ཐོགས་པ་མེད་ལ་རྣམ་པར་དག་པས་བརྒྱན་པ་འདི་དྲན་ནོ།
en: Through this bodhisattva liberation called the display of pure, unimpeded memory , I remember those tathāgatas from the time they attained the level of a bodhisattva until the time their Dharma ceased to exist.

source: །རྗེས་སུ་དྲན་ནོ། །བཟུང་ངོ་། །ཡོངས་སུ་བཟུང་ངོ་། །ཉེ་བར་བཟུང་ངོ་། །རྗེས་སུ་འབྲང་བར་བྱེད་དོ།
en: I recollect that, grasp that, retain that, reflect upon that, and follow that.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་མུན་པའི་མུན་ནག་དང་བྲལ་བ། འཁོར་བའི་ནམ་ནངས་པ། སྒྲིབ་པ་དང་བྲལ་བ། གཉིད་མེད་པ་ལ་མོས་ཤིང་།
en: “Noble one, I know only this bodhisattva liberation called the display of pure, unimpeded memory

source: དགའ་བ་སྙོམས་པ་དང་། ལེ་ལོ་རྣམ་པར་སྤངས་པ། ལུས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་བྱང་བ། རྟག་པར་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཁོང་དུ་ཆུད་པས་ཤིན་ཏུ་དག་པ། སྟོབས་བཅུ་རྣམ་པར་དག་པ་ཁོང་དུ་ཆུད་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know or describe the qualities of the bodhisattvas who are free from the blindness of darkness, who have risen out of saṃsāra, who are free of obscurations, who aspire not to be asleep, who are free of apathy and idleness, whose body formations are purified, who continuously understand the nature of all phenomena, and who have realized the pure ten strengths? “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་ན་བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་ཞེས་བྱ་བ་འདུག་གིས།
en: In the great city of Kapilavastu resides a teacher of children by the name of Viśvāmitra.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་རངས་ཏེ།
en: Go to him and ask him, ‘How should a bodhisattva train in and practice bodhisattva conduct?’

source: མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས། དགེ་བའི་རྩ་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཤུགས་དྲག་པོ་རྣམ་པར་འཕེལ་བས།
en: Then Sudhana, the head merchant’s son, filled with joy, delighted, elated, pleased, and happy, bowed his head to the feet of the deva maiden Surendrābhā.

source: ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ཀྱི་དྲུང་ནས་སོང་ངོ་།
en: He circumambulated the deva maiden Surendrābhā many hundreds of thousands of times, keeping her to his right, and, looking back at her again and again, departed from the deva maiden Surendrābhā. Viśvāmitra

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་སུམ་ཅུ་རྩ་གསུམ་གྱི་དབང་པོའི་གནས་ནས་བབས་ཏེ། མཐར་གྱིས་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་སུ་བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་གང་ན་བ་དེར་སོང་སྟེ། ཕྱིན་ནས།
en: Sudhana descended from the paradise of the lord of Trāyastriṃśa and eventually came to Viśvāmitra, the teacher of children, in the city of Kapilavastu.

source: བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: When he came to him, he bowed his head to the feet of Viśvāmitra, the teacher of children;

source: བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: circumambulated Viśvāmitra, the teacher of children, many hundreds of thousands of times, keeping him to his right;

source: བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་གྱི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: and then stood before Viśvāmitra, the teacher of children, with his palms together in homage and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན།
en: Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ། དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་གྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Ārya, I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: །རིགས་ཀྱི་བུ་ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པ་ཞེས་བྱ་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལས་ཡི་གེའི་ཤེས་པ་སློབ་སློབ་པ་ཡིན་གྱིས་འདིའི་གན་དུ་སོང་སྟེ་དྲིས་དང་། འདི་ནི་ཁྱོད་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བྱ་བ་སྟོན་པར་འགྱུར་རོ་ཞེས་ནས།
en: When he had said that, Viśvāmitra, the teacher of children, said to Sudhana, the head merchant’s son, “Noble one, Śilpābhijña, a head merchant’s son here, has studied the knowledge of words from bodhisattvas. You should go to him and ask him, and he will teach you how bodhisattvas should train in bodhisattva conduct and how they should practice it.” Śilpābhijña

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས། ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པ་གང་ན་བ་དེར་སོང་སྟེ།
en: Sudhana went to where Śilpābhijña, the head merchant’s son, was present.

source: ཕྱིན་ནས་ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པའི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: When he came to him, he bowed his head to the feet of Śilpābhijña, the head merchant’s son, then stood before Śilpābhijña, the head merchant’s son, with his palms together in homage and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ།
en: Ārya, I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བཟོ་མངོན་པར་ཤེས་པ་དང་ལྡན་པ་ཐོབ་པ་སྟེ།
en: When he had said that, Śilpābhijña, the head merchant’s son, said, “Noble one, I have attained the bodhisattva liberation called higher knowledge of the arts

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ཡི་གེའི་མ་མོ་སློབ་པའི་ཚེ་ཡི་གེ་ཨ་བརྗོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མཐུས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཡུལ་ཐ་མི་དད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Noble one, in that way, while studying the alphabet, through reciting the letter A and through the power of a bodhisattva, I realized the gateway to the perfection of wisdom called the undifferentiated range

source: །ར་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་གཞིའི་བྱེ་བྲག་མཐའ་ཡས་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ra I realized the gateway to the perfection of wisdom called the infinite particulars of the bases

source: །པ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་ཡང་དག་པར་འདྲེན་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Pa I realized the gateway to the perfection of wisdom called blendingthe basis of the realm of phenomena.

source: །ཙ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འཁོར་ལོ་རྣམ་པར་ཕྱེ་བ་ཀུན་ནས་གཅོད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ca I realized the gateway to the perfection of wisdom called dividing the wheel

source: །ན་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་གནས་མྱེད་པས་གཞི་ཐུག་པ་མེད་པ་ཞེས་བྱ་བ་ཁོང་ད་ཆུད་དོ།
en: “Through reciting the letter Na I realized the gateway to the perfection of wisdom called without location and without basis

source: །ལ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མྱིང་དང་བྲལ་ཏེ། གནས་མྱེད་པས་དྲི་མ་མྱེད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter La I realized the gateway to the perfection of wisdom called stainless through having no name and no location

source: །ད་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སྦྱོར་བ་ཕྱིར་མྱི་ལྡོག་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Da I realized the gateway to the perfection of wisdom called irreversible union

source: །བ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ba I realized the gateway to the perfection of wisdom called the vajra field

source: །ཌ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཀུན་ཏུ་འཁོར་བ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ḍa I realized the gateway to the perfection of wisdom called the complete wheel

source: །ཥ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ṣa I realized the gateway to the perfection of wisdom called the essence of the ocean

source: །བ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཀུན་ནས་རྣམ་པར་འཕེལ་བར་རྣམ་པར་བསྒྲུབ་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: Through reciting the letter Va I realized the gateway to the perfection of wisdom called the accomplishment of complete increase

source: །ཏ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སྐར་མའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ta I realized the gateway to the perfection of wisdom called the field of stars

source: །ཡ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཕུང་པོ་ཐ་མི་དད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ya I realized the gateway to the perfection of wisdom called the undifferentiatedheap.

source: །ཥྚ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་གདུང་བ་ཀུན་ནས་ཞི་བར་བྱེད་པའི་འོད་ཅེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ṣṭa I realized the gateway to the perfection of wisdom called the cessation of all torment

source: །ཀ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སྤྲིན་ཐ་མྱི་དད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ka I realized the gateway to the perfection of wisdom called undifferentiated clouds

source: །ས་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆར་མངོན་པར་འབབ་པས་ཁྱབ་པར་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Sa I realized the gateway to the perfection of wisdom called the pervading rainfall

source: །མ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཤུགས་ཆེན་པོས་བརྒྱན་པའི་རྩེ་མོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ma I realized the gateway to the perfection of wisdom called the pinnacle adorned by great power

source: །ག་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཀུན་ནས་རྣམ་པར་བསྒྲུབ་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ga I realized the gateway to the perfection of wisdom called complete accomplishment

source: །ཐ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་དེ་བཞིན་ཉིད་ཐ་མྱི་དད་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Tha I realized the gateway to the perfection of wisdom called the undifferentiated essence of the true nature

source: །ཛ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འགྲོ་བའི་འཁོར་བ་རྣམ་པར་དག་པ་ལ་འཇུག་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ja I realized the gateway to the perfection of wisdom called entering the purification of the saṃsāra of beings

source: །སྭ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སངས་རྒྱས་ཐམས་ཅད་དྲན་པས་བརྒྱན་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Sva I realized the gateway to the perfection of wisdom called the display of the memory of all the buddhas

source: །དྷ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དཔྱོད་པ་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Dha I realized the gateway to the perfection of wisdom called the analysis through examination of the field of phenomena

source: །ཤ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གདམས་ངག་གི་འཁོར་ལོ་སྣང་བ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Śa I realized the gateway to the perfection of wisdom called the light of the wheel of instruction of all the buddhas

source: །ཁ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མངོན་པར་འདུ་བྱ་བའི་རྒྱུ་དང་སའི་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Kha I realized the gateway to the perfection of wisdom called the essence of the knowledge of the causes and levels of the composite

source: །ཀྴ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ལས་ཞི་བ་རྒྱ་མཚོའི་མཛོད་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Kṣa I realized the gateway to the perfection of wisdom called examining the treasure of the ocean of the pacification of karma

source: །སྟ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཉོན་མོངས་པ་ཐམས་ཅད་རྣམ་པར་འཐོར་བས་རྣམ་པར་དག་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Sta I realized the gateway to the perfection of wisdom called the essenceof purity through dispelling all kleśas.

source: །ཉ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འཇིག་རྟེན་འབྱུང་བ་རྣམ་པར་དམྱིགས་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ña I realized the gateway to the perfection of wisdom called perceiving the origin of the world

source: །ཕ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འཁོར་བ་དང་མྱི་མཐུན་པའི་འཁོར་ལོའི་ཡེ་ཤེས་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Pha I realized the gateway to the perfection of wisdom called the field of the knowledge of the wheel that counters saṃsāra

source: །བྷ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་གནས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་དམྱིགས་པར་བརྒྱན་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Bha I realized the gateway to the perfection of wisdom called the display of the perception of the entire field of dwellings

source: །ཚ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་བསྩགས་པ་དམ་པའི་ཐབས་ཀྱི་སྤྱོད་པའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་ཐ་དད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Cha I realized the gateway to the perfection of wisdom called the different fields of the parasols that engage in the methodsfor supreme accumulation.

source: །སྨ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སངས་རྒྱས་ཐམས་ཅད་བལྟ་བའི་ཕྱོགས་ལ་མངོན་དུ་གྱུར་བ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Sma I realized the gateway to the perfection of wisdom called turning in the direction of the vision of all buddhas

source: །ཧྭ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དོག་ལ་རྣམ་པར་ལྟ་བའི་སྟོབས་ཤིན་ཏུ་སྐྱེས་པ་རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Hva I realized the gateway to the perfection of wisdom called the essence of the oceanthat gives rise to the power to see the appearances of all beings.

source: །ཡས་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཡོན་ཏན་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་ནན་ཏན་རྟོགས་པར་འཇུག་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Tsa I realized the gateway to the perfection of wisdom called entering the realization of the practice of the ocean of all qualities

source: །གྷ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཐམས་ཅད་ཀྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པའི་རྒྱ་མཚོ་བརྟན་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Gha I realized the gateway to the perfection of wisdom called the unwavering ocean of holding the clouds of all the Dharma

source: །ཊ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་ཕྱོགས་སུ་མངོན་པར་འགྲོ་བ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ṭa I realized the gateway to the perfection of wisdom called going in the direction of the prayers of all the buddhas

source: །ན་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཡི་གེ་འཁོར་ལོ་མྱི་ཟད་པའི་མཐའ་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ṇa I realized the gateway to the perfection of wisdom called analyzing the end of the inexhaustible wheel of letters

source: །སྤ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་མཐར་ཕྱིན་པའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Spha I realized the gateway to the perfection of wisdom called the field of fully accomplishing the ripening of all beings

source: །སྐ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སའི་སྙིང་པོ་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོགས་པ་མྱེད་པར་སྣང་བས་འཁོར་ལོ་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ska I realized the gateway to the perfection of wisdom called the pervasion of the wheel through the light of the unimpeded discernment of the essences of the bhūmis

source: །སྨ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཤིན་ཏུ་བསྟན་པའི་ཡུལ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ysa I realized the gateway to the perfection of wisdom called the range of the perception of the Dharma teaching of all the buddhas

source: །ཤྩ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སེམས་ཅན་གྱི་ནམ་མཁའ་ལས་ཆོས་ཀྱི་སྤྲིན་གྱི་འབྲུག་སྒྲ་བྱུང་བས་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Śca I realized the gateway to the perfection of wisdom called the pervasion of the thunder that comes from the clouds of Dharma in the sky of beings

source: །ཋ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སེམས་ཅན་གྱི་དོན་བདག་མྱེད་པའི་དགོས་པ་མཐར་ཕྱིན་པར་ཟིན་པའི་སྒྲོན་མ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ།
en: “Through reciting the letter Ṭha I realized the gateway to the perfection of wisdom called the lamp that possesses the complete accomplishment of the necessity of the absence of a self for the sake of beings

source: །དྷ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཀྱི་འཁོར་ལོ་ཐ་མི་དད་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་དེ་ལྟར་ཡི་གེའི་མ་མོ་སློབ་པའི་ཚེ།
en: “Through reciting the letter Ḍha I realized the gateway to the perfection of wisdom called the undifferentiated essence of the wheel of the Dharma

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་དེ་དག་ལ་སྩོགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཚད་མེད་གྲངས་མེད་པ་ཞིག་ཁོང་དུ་ཆུད་དེ།
en: “Noble one, I have realized those entrances to the perfection of wisdom and so on, countless innumerable entrances to the perfection of wisdom.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བཟོ་མངོན་པར་ཤེས་པ་དང་ལྡན་པ་འདི་ཐོབ་པ་སྟེ།
en: “Noble one, in that way, I have attained the bodhisattva liberation called higher knowledge of the arts
